export function PrivacyPolicyPage() {
    return (
        <div className="prose dark:prose-invert max-w-none opacity-0 animate-fade-in-up">
            <h1>Политика конфиденциальности</h1>
            <p className="lead">
                 Дата последнего обновления: 29 июля 2024 г.
            </p>

            <h2>1. Сбор информации</h2>
            <p>
                Мы собираем информацию, которую вы предоставляете нам напрямую, например, когда вы создаете учетную запись, обновляете свой профиль, участвуете в турнирах или иным образом общаетесь с нами. Типы информации, которую мы можем собирать, включают ваше имя, адрес электронной почты, пароль, игровую статистику и любую другую информацию, которую вы решите предоставить.
            </p>

            <h2>2. Использование информации</h2>
            <p>
                Мы можем использовать информацию о вас для различных целей, в том числе для:
            </p>
            <ul>
                <li>Предоставления, поддержки и улучшения нашего Сервиса.</li>
                <li>Отправки вам технических уведомлений, обновлений, предупреждений безопасности и сообщений поддержки и администрирования.</li>
                <li>Ответа на ваши комментарии, вопросы и запросы и предоставления клиентского обслуживания.</li>
                <li>Мониторинга и анализа тенденций, использования и деятельности в связи с нашим Сервисом.</li>
            </ul>

            <h2>3. Обмен информацией</h2>
            <p>
                Мы не передаем вашу личную информацию третьим лицам, за исключением случаев, описанных в настоящей Политике конфиденциальности. Мы можем передавать информацию о вас следующим образом или иным образом, описанным в настоящей Политике:
            </p>
            <ul>
                <li>С поставщиками, консультантами и другими поставщиками услуг, которым необходим доступ к такой информации для выполнения работ от нашего имени.</li>
                <li>В ответ на запрос информации, если мы считаем, что раскрытие соответствует любому применимому законодательству, постановлению или судебному процессу.</li>
            </ul>

            <h2>4. Безопасность</h2>
            <p>
                ProDvor принимает разумные меры для защиты информации о вас от потери, кражи, неправильного использования и несанкционированного доступа, раскрытия, изменения и уничтожения.
            </p>
        </div>
    );
}
