
export function TermsOfUsePage() {
    return (
        <div className="prose dark:prose-invert max-w-none opacity-0 animate-fade-in-up">
            <h1>Условия использования</h1>
            <p className="lead">
                 Дата последнего обновления: 29 июля 2024 г.
            </p>

            <h2>1. Принятие Условий</h2>
            <p>
                Используя платформу ProDvor («Сервис»), вы соглашаетесь соблюдать настоящие Условия использования («Условия»). Если вы не согласны с какими-либо из этих условий, вам запрещается использовать или получать доступ к этому сайту.
            </p>

            <h2>2. Описание Сервиса</h2>
            <p>
                Сервис предоставляет пользователям инструменты для создания команд, участия в турнирах и взаимодействия с другими участниками спортивного и киберспортивного сообщества. Все новые функции, которые могут быть добавлены в будущем, также будут подпадать под действие настоящих Условий.
            </p>

            <h2>3. Поведение пользователей</h2>
            <p>
                Вы соглашаетесь не использовать Сервис для:
            </p>
            <ul>
                <li>Публикации незаконного, вредоносного, угрожающего, оскорбительного, клеветнического или иного нежелательного контента.</li>
                <li>Выдачи себя за какое-либо физическое или юридическое лицо.</li>
                <li>Нарушения прав интеллектуальной собственности.</li>
            </ul>
             <p>
                Мы оставляем за собой право удалять любой контент и блокировать пользователей, нарушающих эти правила, без предварительного уведомления.
            </p>

            <h2>4. Ограничение ответственности</h2>
             <p>
                Сервис предоставляется «как есть». ProDvor не дает никаких гарантий, явных или подразумеваемых, и настоящим отказывается от всех других гарантий. Кроме того, ProDvor не гарантирует и не делает никаких заявлений относительно точности, вероятных результатов или надежности использования материалов на своем веб-сайте.
            </p>

            <h2>5. Изменения в Условиях</h2>
            <p>
                Мы оставляем за собой право по собственному усмотрению изменять или заменять настоящие Условия в любое время.
            </p>
        </div>
    );
}
